<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Transmission.</string>
    <key>Identifier</key>
    <string>com.github.jleggat.Transmission.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Transmission</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://update.transmissionbt.com/appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
	        <key>Processor</key>
			<string>CodeSignatureVerifier</string>
	    	<key>Arguments</key>
			<dict>
			    <key>input_path</key>
			    <string>%pathname%/Transmission.app</string>
			    <key>requirement</key>
			    <string>identifier "org.m0k.transmission" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5DPYRBHEAR"</string>
		    </dict>
		</dict>
    </array>
</dict>
</plist>
